Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
K7B12ZcdVVFUEdpaAiKZ prow
                prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
                prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCwi6eXzsTjaeveXEfdbKBVD1oyX8fNwlETQVUctA56HxlxAbg0oKIGDoc04O4eWiamRKdIzc9WZIS/I56vVxcA0zBl/jwsnRpOpaUZh/wgXQtXa+/k3B7tZTZxeao1gefEUzUXJWr92QYZFrA0D82QdixqDpZfEPc8OeKeObfnKWPOZNtXt5X8b9VhzhmFUNPyzG6Tr2Mv8NGh/lrnA+nBCe+Yiw+8is4fLGhQmidw1xX2zLS65nJfmEhaqQObbDCqrAmAP0CXSOBCsZhcU2ibi8VLKCzcmhpAdhdbwW/kaeNHQSXkcAy0hkxGy41stNXDvkJPEKeCuUvA+ZB48G3PvMQ7yCr8JK6cHdxOJLr5NcxjREIk7wkwhL07MCU+keVufWwUP3H8vXR5CtI8soCSBW7QnmhQfToHkdnsYC0S9zIndx1K7ZGKlQbVQc+FLOXNtlYXc3XH7wf0PNcVActlhMG6CIPjiU7jFcmnbqASyX/qSMreBcqpojNeA08x4Rk= prow
            EOT
        }
        project  = "k8s-infra-e2e-boskos-scale-28"
    }

  # google_compute_project_metadata.default["k8s-infra-e2e-boskos-scale-29"] will be updated in-place
  # (imported from "k8s-infra-e2e-boskos-scale-29")
~ resource "google_compute_project_metadata" "default" {
        id       = "k8s-infra-e2e-boskos-scale-29"
      ~ metadata = {
          + "enable-oslogin" = "FALSE"
            "ssh-keys"       = <<-EOT
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCmYxHh/wwcV0P1aChuFLpl28w6DFyc7G5Xrw1F8wH1Re9AdxyemM2bTZ/PhsP3u9VDnNbyOw3UN00VFdumkFLjLf1WQ7Q6rZDlPjlw7urBIvAMqUecY6ae1znqsZ0dMBxOuPXHznlnjLjM5b7O7q5WsQMCA9Szbmz6DsuSyCuX0It2osBTN+8P/Fa6BNh3W8AF60M7L8/aUzLfbXVS2LIQKAHHD8CWqvXhLPuTJ03iSwFvgtAK1/J2XJwUP+OzAFrxj6A9LW5ZZgk3R3kRKr0xT/L7hga41rB1qy8Uz+Xr/PTVMNGW+nmU4bPgFchCK0JBK7B12ZcdVVFUEdpaAiKZ prow
                prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCwi6eXzsTjaeveXEfdbKBVD1oyX8fNwlETQVUctA56HxlxAbg0oKIGDoc04O4eWiamRKdIzc9WZIS/I56vVxcA0zBl/jwsnRpOpaUZh/wgXQtXa+/k3B7tZTZxeao1gefEUzUXJWr92QYZFrA0D82QdixqDpZfEPc8OeKeObfnKWPOZNtXt5X8b9VhzhmFUNPyzG6Tr2Mv8NGh/lrnA+nBCe+Yiw+8is4fLGhQmidw1xX2zLS65nJfmEhaqQObbDCqrAmAP0CXSOBCsZhcU2ibi8VLKCzcmhpAdhdbwW/kaeNHQSXkcAy0hkxGy41stNXDvkJPEKeCuUvA+ZB48G3PvMQ7yCr8JK6cHdxOJLr5NcxjREIk7wkwhL07MCU+keVufWwUP3H8vXR5CtI8soCSBW7QnmhQfToHkdnsYC0S9zIndx1K7ZGKlQbVQc+FLOXNtlYXc3XH7wf0PNcVActlhMG6CIPjiU7jFcmnbqASyX/qSMreBcqpojNeA08x4Rk= prow
                prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
                prow:prow:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC+/ZdafYYrJknk08g98sYS1Nr+aVdAnhHpQyXBx7EAT9pazCGaoiYnXgC82FAfTVMqdsqnIiP+7FgQTFLNYvBt8KsBd9qCkuMh/Q1QYVh4kfjjuGUrjfo020pxGSvp+67kbxm6lubaio9AgJ9XXE+SP1AYbyKTvXEzk5Tu7gGnRt3OrjVB+9eqTnVJOjS/BAOTJV5DWQ7xMubHlT9NmQ/S2hotMoiJJybYGUalOfcf8ZkyspU2oR+x13DCfjvFdzF4U0fb/uvTJZeu22w887M5y0YQulFY2LIeoAUE4XwoOv0nxzwbtZpqPHwtfLgq3G906KHW5e6slXu8kGda656n prow
            EOT
        }
        project  = "k8s-infra-e2e-boskos-scale-29"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-01"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-01"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-01"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-01"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-02"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-02"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-02"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-02"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-03"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-03"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-03"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-03"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-04"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-04"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-04"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-04"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-05"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-05"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-05"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-05"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-06"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-06"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-06"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-06"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-07"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-07"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-07"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-07"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-08"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-08"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-08"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-08"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-09"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-09"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-09"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-09"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-10"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-10"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-10"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-10"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-11"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-11"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-11"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-11"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-12"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-12"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-12"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-12"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-13"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-13"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-13"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-13"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-14"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-14"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-14"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-14"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-15"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-15"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-15"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-15"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-16"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-16"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-16"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-16"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-17"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-17"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-17"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-17"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-18"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-18"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-18"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-18"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-19"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-19"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-19"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-19"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-20"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-20"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-20"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-20"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-21"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-21"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-21"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-21"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-22"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-22"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-22"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-22"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-23"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-23"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-23"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-23"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-24"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-24"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-24"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-24"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-25"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-25"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-25"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-25"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-26"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-26"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-26"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-26"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-27"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-27"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-27"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-27"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-28"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-28"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-28"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-28"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-29"].google_artifact_registry_repository.repo will be created
+ resource "google_artifact_registry_repository" "repo" {
      + cleanup_policy_dry_run = false
      + create_time            = (known after apply)
      + effective_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + format                 = "DOCKER"
      + id                     = (known after apply)
      + location               = "us"
      + mode                   = "STANDARD_REPOSITORY"
      + name                   = (known after apply)
      + project                = "k8s-infra-e2e-boskos-scale-29"
      + repository_id          = "gcr.io"
      + terraform_labels       = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time            = (known after apply)

      + cleanup_policies {
          + action = "DELETE"
          + id     = "delete-images-older-than-7-days"

          + condition {
              + older_than            = "604800s"
              + package_name_prefixes = []
              + tag_prefixes          = []
              + tag_state             = "ANY"
              + version_name_prefixes = []
                # (1 unchanged attribute hidden)
            }
        }

      + vulnerability_scanning_config (known after apply)
    }

  # module.artifact_registry["k8s-infra-e2e-boskos-scale-29"].google_artifact_registry_repository_iam_member.readers["allUsers"] will be created
+ resource "google_artifact_registry_repository_iam_member" "readers" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + location   = "us"
      + member     = "allUsers"
      + project    = "k8s-infra-e2e-boskos-scale-29"
      + repository = (known after apply)
      + role       = "roles/artifactregistry.reader"
    }

  # module.project["k8s-infra-e2e-boskos-scale-01"].module.project-factory.google_project.main will be updated in-place
  # (imported from "k8s-infra-e2e-boskos-scale-01")
~ resource "google_project" "main" {
      ~ auto_create_network = true -> false
        billing_account     = "018801-93540E-22A20E"
        deletion_policy     = "PREVENT"
        effective_labels    = {}
        folder_id           = "671970672807"
        id                  = "projects/k8s-infra-e2e-boskos-scale-01"
        labels              = {}
        name                = "k8s-infra-e2e-boskos-scale-01"
        number              = "40460865376"
        org_id              = null
        project_id          = "k8s-infra-e2e-boskos-scale-01"
        terraform_labels    = {}
    }

  # module.project["k8s-infra-e2e-boskos-scale-01"].module.project-factory.random_id.random_project_id_suffix will be created
+ resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project["k8s-infra-e2e-boskos-scale-02"].module.project-factory.google_project.main will be updated in-place
  # (imported from "k8s-infra-e2e-boskos-scale-02")
~ resource "google_project" "main" {
      ~ auto_create_network = true -> false
        billing_account     = "018801-93540E-22A20E"
        deletion_policy     = "PREVENT"
        effective_labels    = {}
        folder_id           = "671970672807"
        id                  = "projects/k8s-infra-e2e-boskos-scale-02"
        labels              = {}
        name                = "k8s-infra-e2e-boskos-scale-02"
        number              = "660290009727"
        org_id              = null
        project_id          = "k8s-infra-e2e-boskos-scale-02"
        terraform_labels    = {}
    }

  # module.project["k8s-infra-e2e-boskos-scale-02"].module.project-factory.random_id.random_project_id_suffix will be created
+ resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project["k8s-infra-e2e-boskos-scale-03"].module.project-factory.google_project.main will be updated in-place
  # (imported from "k8s-infra-e2e-boskos-scale-03")
~ resource "google_project" "main" {
      ~ auto_create_network = true -> false
        billing_account     = "018801-93540E-22A20E"
        deletion_policy     = "PREVENT"
        effective_labels    = {}
        folder_id           = "671970672807"
        id                  = "projects/k8s-infra-e2e-boskos-scale-03"
        labels              = {}
        name                = "k8s-infra-e2e-boskos-scale-03"
        number              = "647280784790"
        org_id              = null
        project_id          = "k8s-infra-e2e-boskos-scale-03"
        terraform_labels    = {}
    }

  # module.project["k8s-infra-e2e-boskos-scale-03"].module.project-factory.random_id.random_project_id_suffix will be created
+ resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project["k8s-infra-e2e-boskos-scale-04"].module.project-factory.google_project.main will be updated in-place
  # (imported from "k8s-infra-e2e-boskos-scale-04")
~ resource "google_project" "main" {
      ~ auto_create_network = true -> false
        billing_account     = "018801-93540E-22A20E"
        deletion_policy     = "PREVENT"
        effective_labels    = {}
        folder_id           = "671970672807"
        id                  = "projects/k8s-infra-e2e-boskos-scale-04"
        labels              = {}
        name                = "k8s-infra-e2e-boskos-scale-04"
        number              = "881216629017"
        org_id              = null
        project_id          = "k8s-infra-e2e-boskos-scale-04"
        terraform_labels    = {}
    }

  # module.project["k8s-infra-e2e-boskos-scale-04"].module.project-factory.random_id.random_project_id_suffix will be created
+ resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project["k8s-infra-e2e-boskos-scale-05"].module.project-factory.google_project.main will be updated in-place
  # (imported from "k8s-infra-e2e-boskos-scale-05")
~ resource "google_project" "main" {
      ~ auto_create_network = true -> false
        billing_account     = "018801-93540E-22A20E"
        deletion_policy     = "PREVENT"
        effective_labels    = {}
        folder_id           = "671970672807"
        id                  = "projects/k8s-infra-e2e-boskos-scale-05"
        labels              = {}
        name                = "k8s-infra-e2e-boskos-scale-05"
        number              = "303929844117"
        org_id              = null
        project_id          = "k8s-infra-e2e-boskos-scale-05"
        terraform_labels    = {}
    }

  # module.project["k8s-infra-e2e-boskos-scale-05"].module.project-factory.random_id.random_project_id_suffix will be created
+ resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project["k8s-infra-e2e-boskos-scale-06"].module.project-factory.google_project.main will be updated in-place
  # (imported from "k8s-infra-e2e-boskos-scale-06")
~ resource "google_project" "main" {
      ~ auto_create_network = true -> false
        billing_account     = "018801-93540E-22A20E"
        deletion_policy     = "PREVENT"
        effective_labels    = {}
        folder_id           = "671970672807"
        id                  = "projects/k8s-infra-e2e-boskos-scale-06"
        labels              = {}
        name                = "k8s-infra-e2e-boskos-scale-06"
        number              = "896865780972"
        org_id              = null
        project_id          = "k8s-infra-e2e-boskos-scale-06"
        terraform_labels    = {}
    }

  # module.project["k8s-infra-e2e-boskos-scale-06"].module.project-factory.random_id.random_project_id_suffix will be created
+ resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.project["k8s-infra-e2e-boskos-scale-07
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.